{
  "professional": [
    {
      "company": "University of Stuttgart",
      "period": "January 2023 – Present",
      "title": "Research Assistant at the Institute of Software Engineering, Dept. Software Quality and Architecture",
      "description": "I have started a PhD program at the University of Stuttgart and work full-time at the Institute of Software Engineering. My research area is gamified e-learning platforms in higher education.",
      "location": "Stuttgart",
      "locationUrl": "https://goo.gl/maps/5fUyYT2tDGiPoAjG8",
      "link": "www.uni-stuttgart.de",
      "linkUrl": "https://www.uni-stuttgart.de/en/"
    },
    {
      "company": "Microsoft",
      "period": "January 2023 – Present",
      "title": "Microsoft Learn Student Ambassador – Beta",
      "description": "I participate in the Microsoft Learn Student Ambassador program, where I provide technical training to students on Azure solutions and other Microsoft products, and host community-building events.",
      "location": "Remote (Stuttgart)",
      "locationUrl": null,
      "link": "studentambassadors.microsoft.com",
      "linkUrl": "https://studentambassadors.microsoft.com/en-US"
    },
    {
      "company": "T-Systems International GmbH",
      "period": "April 2021 – December 2022",
      "title": "Part-time – IT Architect / Product Owner",
      "description": "I have been promoted to an IT Architect and am leaving the junior position behind. I also became the product owner of a new project, acting between the client and the development team to drive the development of new software.",
      "location": "Leinfelden-Echterdingen",
      "locationUrl": "https://goo.gl/maps/wcfQcqeNZm71UhNu6",
      "link": "www.t-systems.com",
      "linkUrl": "https://www.t-systems.com/de/en/careers"
    },
    {
      "company": "T-Systems International GmbH",
      "period": "April 2020 – March 2021",
      "title": "Part-time – Junior IT Architect",
      "description": "I have reduced my working time to focus on my master's studies, but continued working with my colleagues to develop customer-specific software and to keep the Application Management running.",
      "location": "Leinfelden-Echterdingen",
      "locationUrl": "https://goo.gl/maps/wcfQcqeNZm71UhNu6",
      "link": "www.t-systems.com",
      "linkUrl": "https://www.t-systems.com/de/en/careers"
    },
    {
      "company": "T-Systems International GmbH",
      "period": "November 2019 – March 2020",
      "title": "Full-time – Junior IT Architect",
      "description": "Employed as an IT Architect, more working like a Scrum Master and Project Manager Support in an international, agile team with software developers all over Europe. I have to manage upcoming issues, deal with the customer needs and I'm responsible for a good working development team.",
      "location": "Leinfelden-Echterdingen",
      "locationUrl": "https://goo.gl/maps/wcfQcqeNZm71UhNu6",
      "link": "www.t-systems.com",
      "linkUrl": "https://www.t-systems.com/de/en/careers"
    },
    {
      "company": "T-Systems International GmbH",
      "subCompany": "(employed at Deutsche Telekom AG)",
      "period": "March 2018 – October 2019",
      "title": "Dual study – Web development",
      "description": "As a front-end developer I was part of a team which had to migrate the front-end from an old JSP web application to the JSF standard. Therefore, I designed and developed the new faces of the web application and was responsible for the responsive webdesign. In the absence of the project manager, I deputized him various times.",
      "location": "Leinfelden-Echterdingen",
      "locationUrl": "https://goo.gl/maps/wcfQcqeNZm71UhNu6",
      "link": "www.telekom.com",
      "linkUrl": "https://www.telekom.com/en/careers"
    },
    {
      "company": "T-Systems International GmbH",
      "subCompany": "(employed at Deutsche Telekom AG)",
      "period": "February 2017 – February 2018",
      "title": "Dual study – Agile development team",
      "description": "Together with a colleague, I founded an agile team of five students and we were responsible for needs of colleagues from all projects in the business area SAS (Sales and Aftersales). We chose Kanban as an agile framework to manage our tasks and to create transparency in the team.",
      "location": "Leinfelden-Echterdingen",
      "locationUrl": "https://goo.gl/maps/wcfQcqeNZm71UhNu6",
      "link": "www.telekom.com",
      "linkUrl": "https://www.telekom.com/en/careers"
    },
    {
      "company": "T-Systems International GmbH",
      "subCompany": "(employed at Deutsche Telekom AG)",
      "period": "October 2016 – January 2017",
      "title": "Dual study – Software architecture",
      "description": "As a student I came into a project where I created UML diagrams and managed the Backlog Items in Siemens Polarion.",
      "location": "Leinfelden-Echterdingen",
      "locationUrl": "https://goo.gl/maps/wcfQcqeNZm71UhNu6",
      "link": "www.telekom.com",
      "linkUrl": "https://www.telekom.com/en/careers"
    }
  ],

  "academic": [
    {
      "institution": "University of Stuttgart",
      "period": "January 2023 – Present",
      "title": "PhD Candidate – Software Engineering",
      "description": "PhD Candidate at the University of Stuttgart in Software Engineering",
      "addons": [
        "Dissertation: Investigation of Adaptive Gamification in Intelligent Tutoring Systems for Software Engineering Education"
      ],
      "location": "Stuttgart",
      "locationUrl": "https://goo.gl/maps/5fUyYT2tDGiPoAjG8"
    },
    {
      "institution": "University of California, Irvine",
      "period": "January 2025 – April 2025",
      "title": "Research Exchange on Software Engineering Education",
      "description": "Research scholar at the UC Irvine in Software Engineering Education",
      "addons": [],
      "location": "Irvine, CA (USA)",
      "locationUrl": "https://maps.app.goo.gl/8bk5ki5hs9RDp7iUA"
    },
    {
      "institution": "University of Stuttgart",
      "period": "April 2020 – September 2022",
      "title": "Master of Science (M.Sc.) – Software Engineering",
      "description": "Master study at the University of Stuttgart in Software Engineering",
      "addons": [
        "Final grade: 1,2",
        "Master's thesis: Interdisciplinary Composition of E-Learning Platforms based on Reusable Low-Code Adapters"
      ],
      "location": "Stuttgart",
      "locationUrl": "https://goo.gl/maps/5fUyYT2tDGiPoAjG8"
    },
    {
      "institution": "University of Kansas (USA)",
      "period": "August 2021 – May 2022",
      "title": "Graduate Direct Exchange (GDX) – Computer Science and Leadership",
      "description": "Study abroad program at the University of Kansas in Computer Science and Leadership",
      "addons": [
        "GPA: 4,0 (USA)"
      ],
      "location": "Lawrence, KS (USA)",
      "locationUrl": "https://goo.gl/maps/8NGaxeLuFeC8Xkcy8"
    },
    {
      "institution": "University of Telecommunications Leipzig",
      "period": "October 2016 – October 2019",
      "title": "Bachelor of Science (B.Sc.) – Applied Computer Science",
      "description": "Dual study at the University of Telecommunications Leipzig in Applied Computer Science in cooperation with Deutsche Telekom AG",
      "addons": [
        "Final grade: 1,9",
        "Bachelor's thesis: Investigation and Evaluation of an Onshore/Offshore IDE solution (Eclipse) based on the IT4IT standard"
      ],
      "location": "Leipzig",
      "locationUrl": "https://goo.gl/maps/hXS6JybdDbDwrqCy6"
    },
    {
      "institution": "Lise-Meitner-Gymnasium Maxdorf",
      "period": "August 2008 – July 2016",
      "title": "High school graduation",
      "description": "High school graduation at Lise-Meitner-Gymnasium",
      "addons": [],
      "location": "Maxdorf",
      "locationUrl": "https://goo.gl/maps/hVQivvkRtjuEN3Zx6"
    }
  ],

  "publications": [
    {
      "title": "Boosting Student Motivation through Game-based Learning in Programming Education with Gamify-IT",
      "date": "February 2026",
      "abstract": "Game-based learning (GBL) has emerged as a powerful instrument for enhancing student engagement and motivation in education. This paper evaluates the impact of Gamify-IT, an educational game designed for programming education, on student motivation and learning experiences. Building on the original Gamify-IT concept, we extended it with novel features, including diverse minigames, leaderboards, and a redesigned achievement system, to align with Marczewski's HEXAD player types.",
      "abstractMore": "The platform was used in a first-semester programming course by about 100 students, and its impact was evaluated through comparative analyses of two cohorts in consecutive CS1 programming courses: one limited to traditional teaching methods and the other incorporating Gamify-IT. Our results demonstrate that Gamify-IT has a positive impact on student motivation, as evidenced by higher initial and sustained motivation levels throughout the semester. Feedback from a survey regarding the usefulness and experiences of the platform highlights its strengths, including an engaging and innovative learning approach, game design, and visuals, while also identifying areas for improvement, such as addressing technical issues and expanding game variety. Despite these challenges, Gamify-IT demonstrates the potential of GBL in programming education, offering valuable insights for designing inclusive and effective gamified educational tools for programming education.",
      "doi": "https://doi.org/10.1145/3770762.3772508"
    },
    {
      "title": "Enhancing Motivation in Software Engineering Education through Gamified Agile Project-based Learning",
      "date": "June 2025",
      "abstract": "Project-based learning (PBL), e.g., student software development projects, is an essential part of today's Software Engineering (SE) education. They allow students to work on real-world projects and gain practical experience as a team. However, several challenges arise in such projects, including learning new technologies and dealing with communication and coordination issues within the team.",
      "abstractMore": "These factors can lead to a lack of motivation to contribute to the project and a decrease in productivity, potentially resulting in an insufficient project outcome. This paper aims to promote student motivation in PBL and increase team productivity by applying gamification. We conducted a user and requirements analysis to identify the needs of students and supervisors of such projects. Based on the insights, we designed and implemented DinoDev, a gamified project management tool that combines project management features with gamification elements. The DinoDev concept was evaluated in a student project, indicating increased motivation and team productivity. The findings are valuable for advancing research on using gamification in PBL and for lecturers to improve their students' motivation and team productivity in SE education.",
      "doi": "https://doi.org/10.1145/3696630.3727241"
    },
    {
      "title": "Empirical Study and Vision for a Holistic Serious Game Platform for Software Engineering Education",
      "date": "June 2025",
      "abstract": "Serious games are becoming increasingly popular in universities to motivate students. Therefore, more and more lecturers are using game-based learning to encourage students to learn the subject matter. However, using serious games in Software Engineering (SE) lectures at universities is rather challenging as the subject is very practice-oriented and requires special kinds of tasks, e.g., practicing programming, software modeling, etc.",
      "abstractMore": "Thus, building serious games and integrating such SE-specific tasks is a serious technical challenge and requires immense development effort. Therefore, before developing new games, students' preferences should be analyzed to increase the chances that these games will be played. To address this issue, we conducted an empirical study with 105 students to investigate the requirements and chances for using serious games in SE education in universities. Our analysis shows that students' preferences vary significantly and that there is no clear indication of a single game type that motivates all students equally. Therefore, our second contribution is a vision for a microservice-based Holistic Serious Game Platform for Software Engineering Education, which supports efficiently developing different serious games and integrating SE-specific mini-games and tasks. Hence, our empirical results and the presented approach support advancing research and development of serious SE games and also sensitize game developers to the needs of SE education.",
      "doi": "https://doi.org/10.1145/3696630.3727237"
    },
    {
      "title": "An Online Integrated Development Environment for Automated Programming Assessment Systems",
      "date": "April 2025",
      "abstract": "The increasing demand for programmers has led to a surge in participants in programming courses, making it increasingly challenging for instructors to assess student code manually. As a result, automated programming assessment systems (APASs) have been developed to streamline this process. These APASs support lecturers by managing and evaluating student programming exercises at scale. However, these tools often do not provide feature-rich online editors compared to their traditional integrated development environments (IDEs) counterparts.",
      "abstractMore": "This absence of key features, such as syntax highlighting and autocompletion, can negatively impact the learning experience, as these tools are crucial for effective coding practice. To address this gap, this research contributes to the field of programming education by extracting and defining requirements for an online IDE in an educational context and presenting a prototypical implementation of an open-source solution for a scalable and secure online IDE. The usability of the new online IDE was assessed using the Technology Acceptance Model (TAM), gathering feedback from 27 first-year students through a structured survey. In addition to these qualitative insights, quantitative measures such as memory (RAM) usage were evaluated to determine the efficiency and scalability of the tool under varying usage conditions.",
      "doi": "https://doi.org/10.5220/0013203000003932"
    },
    {
      "title": "Enhanced Program Comprehension: Individualized Learning of Code Tracing with the Feedback Buddy",
      "date": "September 2024",
      "abstract": "The increasing importance of programming skills for various professions highlights the necessity of laying solid foundations for these skills in school. One critical step when learning programming is code tracing, i.e., the ability to analyze program code to predict the data changes when the code is executed. Considering the diverse levels of prior knowledge in computer science classes, it is essential to implement tailored teaching approaches, which can enhance the respective learning outcomes.",
      "abstractMore": "To create personalized learning paths, we developed the tutoring system Feedback Buddy that teaches if-else branches, for loops, and combinations of them using tracing tables. Thereby, the Feedback Buddy adapts its feedback and task difficulty based on learners' affective, cognitive, and metacognitive states. Extending former systems, our approach focuses on school education and uses growth mindset feedback. Evaluation with 10th grade students in computer science classes yielded positive results, affirming the usability and usefulness of the Feedback Buddy in secondary school education.",
      "doi": "https://doi.org/10.18420/delfi2024_16"
    },
    {
      "title": "Automated Programming Exercise Generation in the Era of Large Language Models",
      "date": "July 2024",
      "abstract": "Lecturers are increasingly attempting to use large language models (LLMs) to simplify and make the creation of exercises for students more efficient. Efforts are also being made to automate the exercise creation process in software engineering (SE) education. This study explores the use of advanced LLMs, including GPT-4 and LaMDA, for automated programming exercise creation in higher education and compares the results with related work using GPT-3.5-turbo.",
      "abstractMore": "Utilizing applications such as ChatGPT, Bing AI Chat, and Google Bard, we identify LLMs capable of initiating different exercise designs. However, manual refinement is crucial for accuracy. Common error patterns across LLMs highlight challenges in complex programming concepts, while specific strengths in various topics showcase model distinctions. This research underscores LLMs' value in exercise generation, emphasizing the critical role of human supervision in refining these processes. Our concise insights cater to educators, practitioners, and other researchers seeking to enhance SE education through LLM applications.",
      "doi": "https://doi.org/10.1109/CSEET62301.2024.10662984"
    },
    {
      "title": "ChatGPT's Aptitude in Utilizing UML Diagrams for Software Engineering Exercise Generation",
      "date": "July 2024",
      "abstract": "The integration of Artificial Intelligence (AI) technologies into educational settings has paved the way for innovative teaching and learning approaches. In Software Engineering (SE) education, using Unified Modeling Language (UML) diagrams is a fundamental teaching element for understanding complex software systems. This research addresses ChatGPT's ability to utilize UML class and sequence diagrams to create SE modeling exercises.",
      "abstractMore": "We use ChatGPT to generate exercises based on the information from uploaded UML diagrams by analyzing textual UML representations such as Mermaid and graphical diagrams. The research explores ChatGPT's ability to synthesize UML-specific information from class and sequence diagrams, enabling the generation of various exercises tailored to strengthen conceptual understanding and practical application. Furthermore, we investigate generating graphical UML class and sequence diagrams based on natural language as input. By bridging the gap between AI-driven natural language understanding and the comprehension of UML diagrams, this study highlights the potential of ChatGPT to improve SE education. Our concise findings address educators, practitioners, and other researchers engaged in the field of SE education with a special focus on UML.",
      "doi": "https://doi.org/10.1109/CSEET62301.2024.10663027"
    },
    {
      "title": "State of Practice and Challenges of Issue Management for Component-based and Service-Oriented Systems: An Empirical Study",
      "date": "July 2024",
      "abstract": "Modern software systems often consist of independently developed components, e.g., libraries or (micro-)services, that can be combined to form a larger architecture. Many of these components are developed externally, i.e., in other projects by other teams, which is particularly the case in service-oriented architectures. Even though the components are independently developed, bugs may arise that propagate along the call chains, which sometimes negatively affect the calling components.",
      "abstractMore": "However, as such components are typically managed in separate issue management systems (IMS), identifying that a downstream component is affected by an upstream component's issues is complex and time-consuming. Even though some scientific works and IMS forums discuss how to manage such cross-component issues, there is no systematic study on the state of practice and the challenges of issue management when different components are affected. Therefore, this study aims to determine which types of components are usually included in modern software projects, how developers identify and manage issue propagation between components, and how often they face such propagations. To get these insights, we conducted an empirical study through a questionnaire with 64 industry experts and open-source contributors and interviewed seven of them. Our key takeaways help researchers and software engineers to understand possible impacts and to improve cross-component issue management. We identified, for example, that related issues currently are non-semantically linked via URLs in issue comments.",
      "doi": "https://doi.org/10.1109/SOSE62363.2024.00007"
    },
    {
      "title": "MEITREX – Gamified and Adaptive Intelligent Tutoring in Software Engineering Education",
      "date": "April 2024",
      "abstract": "Nowadays, learning management systems (LMSs) are established tools in higher education, especially in the domain of software engineering (SE). However, the potential of such educational technologies has not been fully exploited, as student performance in SE education is still strongly dependent on feedback from time-constrained lecturers and tutors.",
      "abstractMore": "Moreover, current LMSs are not designed for SE courses, as external SE tools are required to fulfill the requirements of lecturers such as programming and UML modeling features. Evolving these LMSs in the direction of intelligent tutoring could assist students in receiving automatic, individual feedback from the LMSs on their learning performance at any time. Also, gamified learning elements can serve to motivate students to engage with SE materials. Therefore, this paper presents an approach combining learning analytics, feedback, and interactive learning such as gamification in one LMS designed for SE education. The system could thus address diverse students with different backgrounds and motivational aspects and provide appropriate individual support to ensure effective SE education.",
      "doi": "https://doi.org/10.1145/3639478.3639804"
    },
    {
      "title": "Unveiling Hurdles in Software Engineering Education: The Role of Learning Management Systems",
      "date": "April 2024",
      "abstract": "Learning management systems (LMSs) are established tools in higher education, especially in the field of software engineering (SE). The onset of the COVID-19 pandemic further amplified the utilization of these systems, which necessitated their integration into educational curricula for both lecturers and students.",
      "abstractMore": "However, adopting LMSs within SE education has presented distinctive challenges impeding their seamless incorporation into the courses. This paper aims to scrutinize the challenges and requirements encountered by professors, lecturers, and students in the domain of SE education when using LMSs. We conducted an empirical study that included (i) a survey with 47 professors/lecturers and 133 students, (ii) an analysis of the ensuing data, and (iii) 18 additional interviews conducted with professors and lecturers to delve into nuanced variations in viewpoints. The findings derived from our study reveal that the challenges and requirements pertaining to LMSs are rather specific depending on the scope and size of the respective courses. Nevertheless, many participants have a consensus on numerous challenges and requirements for improving certain features of LMSs in order to improve their usage in SE education. The findings are valuable for advancing research and development in the field of LMSs and provide guidance for lecturers in SE education.",
      "doi": "https://doi.org/10.1145/3639474.3640060"
    },
    {
      "title": "EvalQuiz — LLM-based Automated Generation of Self-Assessment Quizzes in Software Engineering Education",
      "date": "February 2024",
      "abstract": "Self-assessment quizzes after lectures, educational videos, or chapters are a commonly used method in software engineering (SE) education to allow students to test the knowledge they have gained. However, creating these quizzes is time-consuming, cognitively exhausting, and complex, as an expert in the field needs to create the quizzes and review the lecture material for validity.",
      "abstractMore": "Therefore, this paper presents a concept to automatically generate self-assessment quizzes based on lecture material using a large language model (LLM) to reduce lecturers' workload and simplify the general quiz creation process. The developed prototype was handed to experts, who subsequently evaluated the approach. The results show that automatic quiz generation saves time, and the quizzes cover the delivered lecture material well. However, the generated quizzes often lack originality and versatility. Therefore, further prompt engineering might be required to achieve more elaborate results.",
      "doi": "https://doi.org/10.18420/seuh2024_04"
    },
    {
      "title": "Investigating the Use of AI-Generated Exercises for Beginner and Intermediate Programming Courses: A ChatGPT Case Study",
      "date": "August 2023",
      "abstract": "In recent years, artificial intelligence (AI) has been increasingly used in education and supports teachers in creating educational material and students in their learning progress. AI-driven learning support has recently been further strengthened by the release of ChatGPT, in which users can retrieve explanations for various concepts in a few minutes through chat.",
      "abstractMore": "However, to what extent the use of AI models, such as ChatGPT, is suitable for the creation of didactically and content-wise good exercises for programming courses is not yet known. Therefore, in this paper, we investigate the use of AI-generated exercises for beginner and intermediate programming courses in higher education using ChatGPT. We created 12 exercise sheets with ChatGPT for a beginner to intermediate programming course focusing on the objects-first approach. We report our process, prompts, and experience using ChatGPT for this task and outline good practices we identified. The generated exercises are assessed and revised, primarily using ChatGPT, until they met the requirements of the programming course. We assessed the quality of these exercises by using them in our external teaching assignment course at the University of Education Ludwigsburg and let the students evaluate them. Results indicate the quality of the generated exercises and the time-saving for creating them using ChatGPT. However, our experience showed that while it is fast to generate a good version of an exercise, almost every exercise requires minor manual changes to improve its quality.",
      "doi": "https://doi.org/10.1109/CSEET58097.2023.00030"
    },
    {
      "title": "An Intelligent Tutoring System Concept for a Gamified e-Learning Platform for Higher Computer Science Education",
      "date": "February 2023",
      "abstract": "Intelligent Tutoring Systems (ITSs) are increasingly used in modern education to automatically give students individual feedback on their performance. The advantage for students is fast individual feedback on their answers to asked questions, while lecturers benefit from considerable time savings and easy delivery of educational material. Of course, it is important that the provided feedback is as effective as direct feedback from the lecturer.",
      "abstractMore": "However, in digital teaching, lecturers cannot assess the student's knowledge precisely but can only provide information on which questions were answered correctly and incorrectly. Therefore, this paper presents a concept for integrating ITS elements into the gamified e-learning platform IT-REX so that the feedback quality can be improved to support students in the best possible way.",
      "doi": "https://doi.org/10.18420/seuh2023_10"
    },
    {
      "title": "IT-REX – A Vision for a Gamified e-Learning Platform for the First Semesters of Computer Science Courses",
      "date": "February 2022",
      "abstract": "Digital learning is becoming increasingly important, especially in situations when students cannot attend presence lectures as we experienced during the Covid-19 pandemic. However, while there are platforms that support generic learning concepts such as multiple-choice questions, we believe that the first semesters of computer science courses can benefit from tailored learning platforms that support IT-specific learning. For example, programming tasks that are automatically checked for correctness.",
      "abstractMore": "Moreover, in times when students cannot meet each other, self-organization and motivation quickly become severe problems. Therefore, this paper presents a vision for a gamified e-Learning platform specialized for the first semesters of computer science courses.",
      "doi": "https://doi.org/10.18420/SEUH2022_05"
    }
  ],

  "certifications": [
    {
      "name": "AWS Certified: Cloud Practitioner",
      "date": "May 2021",
      "issuer": "AWS – Amazon Web Services",
      "link": "aws.amazon.com",
      "linkUrl": "https://aws.amazon.com/certification/certified-cloud-practitioner/?nc1=h_ls"
    },
    {
      "name": "Microsoft Certified: Azure Fundamentals",
      "date": "April 2021",
      "issuer": "Microsoft",
      "link": "microsoft.com",
      "linkUrl": "https://docs.microsoft.com/en-us/learn/certifications/azure-fundamentals/"
    },
    {
      "name": "Certified Professional for Software Architecture – Foundation Level (CPSA-F)",
      "date": "November 2020",
      "issuer": "iSAQB – International Software Architecture Qualification Board",
      "link": "www.isaqb.org",
      "linkUrl": "https://www.isaqb.org/certifications/"
    },
    {
      "name": "Professional Scrum Master (PSM)",
      "date": "March 2019",
      "issuer": "Scrum – Agile Framework",
      "link": "www.scrum.org",
      "linkUrl": "https://www.scrum.org/professional-scrum-master-i-certification"
    },
    {
      "name": "Professional Scrum Product Owner (PSPO)",
      "date": "February 2019",
      "issuer": "Scrum – Agile Framework",
      "link": "www.scrum.org",
      "linkUrl": "https://www.scrum.org/professional-scrum-product-owner-i-certification"
    },
    {
      "name": "Certified Agile Requirements Specialist (CARS)",
      "date": "December 2018",
      "issuer": "Agile Requirements",
      "link": "agile-requirements-institute.org",
      "linkUrl": "http://agile-requirements-institute.org/certified-agile-requirements-specialist.html"
    },
    {
      "name": "Global English – Virtual Classroom Learnlight Academy",
      "date": "May 2018",
      "issuer": "Business English",
      "link": "www.learnlight.com",
      "linkUrl": "https://www.learnlight.com/en/"
    }
  ],

  "awards": [
    {
      "organization": "Deutscher Akademischer Austauschdienst e.V. (DAAD)",
      "date": "January 2025",
      "title": "DAAD – Research scholarship for doctoral candidates",
      "link": "www.daad.de",
      "linkUrl": "https://www2.daad.de/ausland/studieren/stipendium/de/70-stipendien-finden-und-bewerben/?detail=57556279"
    }
  ],

  "volunteering": [
    {
      "organization": "ACM Special Interest Group on Computer Science Education (SIGCSE TS)",
      "period": "July 2025 – Present",
      "title": "Committee Member in Program Committee",
      "description": "I review scientific papers, experience reports, and tools and provide feedback to facilitate the international SIGCSE TS conference.",
      "link": "sigcse2026.sigcse.org",
      "linkUrl": "https://sigcse2026.sigcse.org/"
    },
    {
      "organization": "IEEE Conference on Software Engineering Education and Training (CSEE&T)",
      "period": "December 2023 – Present",
      "title": "Committee Member in Program Committee",
      "description": "I review scientific papers, experience reports, and tools and provide feedback to facilitate the international CSEE&T conference.",
      "link": "conf.researchr.org",
      "linkUrl": "https://conf.researchr.org/home/icse-2025/cseet-2025"
    },
    {
      "organization": "UEFA EURO 2024",
      "period": "June 2024 – July 2024",
      "title": "EURO 2024 Volunteer – Stuttgart",
      "description": "I was one of 16,000 volunteers who contributed to making the EURO 2024 in Germany a success.",
      "link": "volunteercommunity.uefa.com",
      "linkUrl": "https://volunteercommunity.uefa.com/"
    }
  ]
}
